Revit 2024 API
BuiltInFailures.AnalyticalModelFailures.AnalyticalGapWarning Property
 Detected physical connection between Structural Elements, but did not detect Analytical intersection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId AnalyticalGapWarning { get; }
Visual Basic
Public Shared ReadOnly Property AnalyticalGapWarning As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ AnalyticalGapWarning {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace